# Width

## Description
Returns the width of an object matching the search criteria. If more than one object matches the search criteria, the function will return the sum of the matching object widths.

```pascal
FUNCTION Width(c : CRITERIA): REAL;
```

```python
def vs.Width(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Examples
==== VectorScript ====
```pascal
WidthValue:=Width(N='Box');
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* Criteria